"""Labyrinthes disponibles : 

Légende :
  #           mur
  S           départ
  G           but
  ' ' ou '.'  case normale (coût 1)
  '2' à '9'   le chiffre est le coût pour entrer dans la case
  
"""

MAZES = {
    "facile": [
        "###############",
        "#S           G#",
        "# # ######### #",
        "# #           #",
        "# ########### #",
        "#             #",
        "###############",
    ],

    "Contour": [
        "###############",
        "#S      #    G#",
        "####### # #####",
        "#       #     #",
        "# ########### #",
        "#             #",
        "###############",
    ],

    "Avec un piège": [
        "###############",
        "#S  9        G#",
        "# # ######### #",
        "# #           #",
        "# ########### #",
        "#             #",
        "###############",
    ],

    "sans_solution": [
        "#######",
        "#S  # #",
        "#   #G#",
        "#   ###",
        "#######",
    ],
}
